app/controllers/api/v1/articles_controller.rb

  def index
    render json: Blog.all
---
SELECT "blogs".* FROM "blogs"

  def set_article_stats
    blog = Blog.find(params[:article_id])
    attribute = params[:event].underscore.to_sym
    blog.update(attribute => blog[attribute] + 1)
    ctr = blog.sign_up.to_f/blog.page_view if blog.page_view!=0
    blog.update(ctr: ctr);
---
SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "blogs" SET "click_count" = $1, "updated_at" = $2 WHERE "blogs"."id" = $3  [["click_count", 5], ["updated_at", "2024-01-15 11:42:01.193352"], ["id", 2]]
UPDATE "blogs" SET "updated_at" = $1 WHERE "blogs"."id" = $2  [["updated_at", "2024-01-15 12:52:17.457864"], ["id", 9]]